---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.WhileScanningParametersForType
source: html/c13bf80a-9514-9232-3421-c38841564f5b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.WhileScanningParametersForType Property

While loading Type '[Name]', parameter '[Name]': [Description]

## Syntax (C#)
```csharp
public static FailureDefinitionId WhileScanningParametersForType { get; }
```